tutorials/mhdFoam/hartmann/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat     raw;

sets      
(
    line_centreProfile 
    {
        type            uniform;

        axis            distance;
        start           (10.001 -1 0.01);
        end             (10.001 1 0.01);
        nPoints         100;
    }
);

surfaces
();

fields          
(
    U.component(0)
);

// ************************************************************************* //
